stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_pwr_ex.h
/** @defgroup PWREx_Supply_Configuration PWR Extended Supply Configuration
  * @{
  */
#define PWR_LDO_SUPPLY                 (0U)             /*!< LDO supply  */
#define PWR_SMPS_SUPPLY                PWR_CR3_REGSEL   /*!< SMPS supply */
/**
  * @}
  */

/** @defgroup PWREx_Regulator_Voltage_Scale PWR Extended Regulator Voltage Scale
  * @{
  */
#define PWR_REGULATOR_VOLTAGE_SCALE1   PWR_VOSR_R1EN    /*!< Voltage scaling range 1 */
#define PWR_REGULATOR_VOLTAGE_SCALE2   PWR_VOSR_R2EN    /*!< Voltage scaling range 2 */
/**
  * @}
  */

/** @defgroup PWREx_VBAT_Battery_Charging_Selection PWR Extended Battery Charging Resistor Selection
  * @{
  */
#define PWR_BATTERY_CHARGING_RESISTOR_5   (0U)          /*!< VBAT charging through a 5 kOhms resistor   */
#define PWR_BATTERY_CHARGING_RESISTOR_1_5 PWR_BDCR_VBRS /*!< VBAT charging through a 1.5 kOhms resistor */
/**
  * @}
  */

/** @defgroup PWREx_GPIO_Port PWR Extended GPIO Port
  * @{
  */
#define PWR_GPIO_A                     (0U)                                    /*!< GPIO port A */
#define PWR_GPIO_B                     (1U)                                    /*!< GPIO port B */
#define PWR_GPIO_C                     (2U)                                    /*!< GPIO port C */
#define PWR_GPIO_D                     (3U)                                    /*!< GPIO port D */
#define PWR_GPIO_E                     (4U)                                    /*!< GPIO port E */
#if defined(RAMCFG_SRAM3)
#define PWR_GPIO_F                     (5U)                                    /*!< GPIO port F */
#endif /* RAMCFG_SRAM3 */
#if defined(PWR_PDCRG_PD15)
#define PWR_GPIO_G                     (6U)                                    /*!< GPIO port G */
#endif /* PWR_PDCRG_PD15 */
#define PWR_GPIO_H                     (7U)                                    /*!< GPIO port H */
/**
  * @}
  */

/** @defgroup PWREx_GPIO_Pin_Mask PWR Extended GPIO Pin Mask
  * @{
  */
#define PWR_GPIO_BIT_0                 (0x00001U)                              /*!< GPIO port I/O pin 0  */
#define PWR_GPIO_BIT_1                 (0x00002U)                              /*!< GPIO port I/O pin 1  */
#define PWR_GPIO_BIT_2                 (0x00004U)                              /*!< GPIO port I/O pin 2  */
#define PWR_GPIO_BIT_3                 (0x00008U)                              /*!< GPIO port I/O pin 3  */
#define PWR_GPIO_BIT_4                 (0x00010U)                              /*!< GPIO port I/O pin 4  */
#define PWR_GPIO_BIT_5                 (0x00020U)                              /*!< GPIO port I/O pin 5  */
#define PWR_GPIO_BIT_6                 (0x00040U)                              /*!< GPIO port I/O pin 6  */
#define PWR_GPIO_BIT_7                 (0x00080U)                              /*!< GPIO port I/O pin 7  */
#define PWR_GPIO_BIT_8                 (0x00100U)                              /*!< GPIO port I/O pin 8  */
#define PWR_GPIO_BIT_9                 (0x00200U)                              /*!< GPIO port I/O pin 9  */
#define PWR_GPIO_BIT_10                (0x00400U)                              /*!< GPIO port I/O pin 10 */
#define PWR_GPIO_BIT_11                (0x00800U)                              /*!< GPIO port I/O pin 11 */
#define PWR_GPIO_BIT_12                (0x01000U)                              /*!< GPIO port I/O pin 12 */
#define PWR_GPIO_BIT_13                (0x02000U)                              /*!< GPIO port I/O pin 13 */
#define PWR_GPIO_BIT_14                (0x04000U)                              /*!< GPIO port I/O pin 14 */
#define PWR_GPIO_BIT_15                (0x08000U)                              /*!< GPIO port I/O pin 15 */
#define PWR_GPIO_PIN_MASK              (0x0FFFFU)
/**
  * @}
  */

/** @defgroup PWREx_I3C_PULLUP_GPIO PWR Extended I3C Pull-up Configuration
  * @{
  */
#define PWR_I3CPU_PA1                  PWR_I3CPUCR1_PA1_I3CPU                            /*!< I3C pull-up on PA1  */
#define PWR_I3CPU_PA6                  PWR_I3CPUCR1_PA6_I3CPU                            /*!< I3C pull-up on PA6  */
#define PWR_I3CPU_PA7                  PWR_I3CPUCR1_PA7_I3CPU                            /*!< I3C pull-up on PA7  */
#define PWR_I3CPU_PB2                  PWR_I3CPUCR1_PB2_I3CPU                            /*!< I3C pull-up on PB2  */
#define PWR_I3CPU_PB6                  PWR_I3CPUCR1_PB6_I3CPU                            /*!< I3C pull-up on PB6  */
#if defined(RAMCFG_SRAM3)
#define PWR_I3CPU_PB7                  PWR_I3CPUCR1_PB7_I3CPU                            /*!< I3C pull-up on PB7  */
#endif /* RAMCFG_SRAM3 */
#if defined(PWR_I3CPUCR1_PB8_I3CPU)
#define PWR_I3CPU_PB8                  PWR_I3CPUCR1_PB8_I3CPU                            /*!< I3C pull-up on PB8  */
#define PWR_I3CPU_PB9                  PWR_I3CPUCR1_PB9_I3CPU                            /*!< I3C pull-up on PB9  */
#endif /* PWR_I3CPUCR1_PB8_I3CPU */
#define PWR_I3CPU_PB10                 PWR_I3CPUCR1_PB10_I3CPU                           /*!< I3C pull-up on PB10 */
#define PWR_I3CPU_PB12                 PWR_I3CPUCR1_PB12_I3CPU                           /*!< I3C pull-up on PB12 */
#define PWR_I3CPU_PB13                 PWR_I3CPUCR1_PB13_I3CPU                           /*!< I3C pull-up on PB13 */
#if defined(PWR_I3CPUCR1_PB8_I3CPU)
#define PWR_I3CPU_PB14                 PWR_I3CPUCR1_PB14_I3CPU                           /*!< I3C pull-up on PB14 */
#define PWR_I3CPU_PC0                  (PWR_I3CPUCR2_PC0_I3CPU  << PWR_I3CUPCR2_OFFSET)  /*!< I3C pull-up on PC0  */
#endif /* PWR_I3CPUCR1_PB8_I3CPU */
#define PWR_I3CPU_PC1                  (PWR_I3CPUCR2_PC1_I3CPU  << PWR_I3CUPCR2_OFFSET)  /*!< I3C pull-up on PC1  */
#define PWR_I3CPU_PD12                 (PWR_I3CPUCR2_PD12_I3CPU << PWR_I3CUPCR2_OFFSET)  /*!< I3C pull-up on PD12 */
#define PWR_I3CPU_PD13                 (PWR_I3CPUCR2_PD13_I3CPU << PWR_I3CUPCR2_OFFSET)  /*!< I3C pull-up on PD13 */
#if defined(PWR_I3CPUCR1_PB8_I3CPU)
#define PWR_I3CPU_PG7                  (PWR_I3CPUCR2_PG7_I3CPU  << PWR_I3CUPCR2_OFFSET)  /*!< I3C pull-up on PG7  */
#define PWR_I3CPU_PG8                  (PWR_I3CPUCR2_PG8_I3CPU  << PWR_I3CUPCR2_OFFSET)  /*!< I3C pull-up on PG8  */
#define PWR_I3CPU_PG13                 (PWR_I3CPUCR2_PG13_I3CPU << PWR_I3CUPCR2_OFFSET)  /*!< I3C pull-up on PG13 */
#define PWR_I3CPU_PG14                 (PWR_I3CPUCR2_PG14_I3CPU << PWR_I3CUPCR2_OFFSET)  /*!< I3C pull-up on PG14 */
#endif /* PWR_I3CPUCR1_PB8_I3CPU */
#define PWR_I3CPU_PH3                  (PWR_I3CPUCR2_PH3_I3CPU  << PWR_I3CUPCR2_OFFSET)  /*!< I3C pull-up on PH3  */

#if defined(RAMCFG_SRAM3)
#define PWR_I3CPUCR_ALL                (PWR_I3CPU_PA1  | PWR_I3CPU_PA6  | PWR_I3CPU_PA7  | PWR_I3CPU_PB2  |\
                                        PWR_I3CPU_PB6  | PWR_I3CPU_PB7  | PWR_I3CPU_PB8  | PWR_I3CPU_PB9  |\
                                        PWR_I3CPU_PB10 | PWR_I3CPU_PB12 | PWR_I3CPU_PB13 | PWR_I3CPU_PB14 |\
                                        PWR_I3CPU_PC0  | PWR_I3CPU_PC1  | PWR_I3CPU_PD12 | PWR_I3CPU_PD13 |\
                                        PWR_I3CPU_PG7  | PWR_I3CPU_PG8  | PWR_I3CPU_PG13 | PWR_I3CPU_PG14 |\
                                        PWR_I3CPU_PH3)
#elif defined(PWR_I3CPUCR1_PB8_I3CPU)
#define PWR_I3CPUCR_ALL                (PWR_I3CPU_PA1  | PWR_I3CPU_PA6  | PWR_I3CPU_PA7  | PWR_I3CPU_PB2  |\
                                        PWR_I3CPU_PB6  | PWR_I3CPU_PB8  | PWR_I3CPU_PB9  | PWR_I3CPU_PB10 |\
                                        PWR_I3CPU_PB12 | PWR_I3CPU_PB13 | PWR_I3CPU_PB14 | PWR_I3CPU_PC0  |\
                                        PWR_I3CPU_PC1  | PWR_I3CPU_PD12 | PWR_I3CPU_PD13 | PWR_I3CPU_PG7  |\
                                        PWR_I3CPU_PG8  | PWR_I3CPU_PG13 | PWR_I3CPU_PG14 | PWR_I3CPU_PH3)
#else
#define PWR_I3CPUCR_ALL                (PWR_I3CPU_PA1  | PWR_I3CPU_PA6  | PWR_I3CPU_PA7  | PWR_I3CPU_PB2  |\
                                        PWR_I3CPU_PB6  | PWR_I3CPU_PB10 | PWR_I3CPU_PB12 | PWR_I3CPU_PB13 |\
                                        PWR_I3CPU_PC1  | PWR_I3CPU_PD12 | PWR_I3CPU_PD13 | PWR_I3CPU_PH3)
#endif /* defined(RAMCFG_SRAM3)*/
/*!<  I3C pull-up all */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup PWREx_Exported_Macros PWR Extended Exported Macros
  * @{
  */

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @addtogroup PWREx_Private_Constants PWR Extended Private Constants
  * @{
  */

