stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_pwr_ex.h
/* All available RAM retention in Standby mode define */
#define PWR_ALL_RAM_STANDBY_RETENTION_MASK (PWR_SRAM2_FULL_STANDBY_RETENTION)

/* Offset for I3C Pull-Up Configuration */
#define PWR_I3CUPCR2_OFFSET            (16U)
/**
  * @}
  */

/* Private macros --------------------------------------------------------*/

/** @addtogroup PWREx_Private_Macros PWR Extended Private Macros
  * @{
  */
/* Supply selection check macro */
#define IS_PWR_SUPPLY(__PWR_SOURCE__)            (((__PWR_SOURCE__) == PWR_LDO_SUPPLY) ||\
                                                  ((__PWR_SOURCE__) == PWR_SMPS_SUPPLY))

/* Voltage scaling range check macro */
#define IS_PWR_VOLTAGE_SCALING_RANGE(__RANGE__)  (((__RANGE__) == PWR_REGULATOR_VOLTAGE_SCALE1) ||\
                                                  ((__RANGE__) == PWR_REGULATOR_VOLTAGE_SCALE2))

/* Battery charging resistor selection check macro */
#define IS_PWR_BATTERY_RESISTOR_SELECT(__RESISTOR__) (((__RESISTOR__) == PWR_BATTERY_CHARGING_RESISTOR_5) ||\
                                                      ((__RESISTOR__) == PWR_BATTERY_CHARGING_RESISTOR_1_5))

/* GPIO port check macro */
#if defined(RAMCFG_SRAM3)
#define IS_PWR_GPIO_PORT(__GPIO_PORT__)          (((__GPIO_PORT__) == PWR_GPIO_A) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_B) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_C) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_D) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_E) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_F) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_G) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_H))
#else
#if defined(PWR_GPIO_G)
#define IS_PWR_GPIO_PORT(__GPIO_PORT__)          (((__GPIO_PORT__) == PWR_GPIO_A) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_B) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_C) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_D) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_E) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_G) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_H))
#else
#define IS_PWR_GPIO_PORT(__GPIO_PORT__)          (((__GPIO_PORT__) == PWR_GPIO_A) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_B) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_C) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_D) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_E) ||\
                                                  ((__GPIO_PORT__) == PWR_GPIO_H))
#endif /* PWR_GPIO_G */
#endif /* defined(RAMCFG_SRAM3) */

/* GPIO pin mask check macro */
#define IS_PWR_GPIO_PIN_MASK(__BIT_MASK__)       ((((__BIT_MASK__) & PWR_GPIO_PIN_MASK) != 0U) &&\
                                                  ((__BIT_MASK__) <= PWR_GPIO_PIN_MASK))

/* RAMs power down check macro */
#if defined(RAMCFG_SRAM3)
#define IS_PWR_RAM_POWERDOWN(__RAM__)            (((__RAM__) == PWR_SRAM1_POWERDOWN) ||\
                                                  ((__RAM__) == PWR_SRAM2_POWERDOWN) ||\
                                                  ((__RAM__) == PWR_SRAM3_POWERDOWN) ||\
                                                  ((__RAM__) == PWR_SRAM4_POWERDOWN))
#else
#define IS_PWR_RAM_POWERDOWN(__RAM__)            (((__RAM__) == PWR_SRAM1_POWERDOWN) ||\
                                                  ((__RAM__) == PWR_SRAM2_POWERDOWN))
#endif /* RAMCFG_SRAM3 */

/* RAMs retention in Stop mode check macro */
#if defined(RAMCFG_SRAM3)
#define IS_PWR_RAM_STOP_RETENTION(__RAM__)       (((__RAM__) == PWR_SRAM1_PAGE1_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE2_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE3_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE4_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE5_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE6_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE7_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_FULL_STOP_RETENTION)  ||\
                                                  ((__RAM__) == PWR_SRAM2_PAGE1_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM2_PAGE2_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM2_PAGE3_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM2_FULL_STOP_RETENTION)  ||\
                                                  ((__RAM__) == PWR_SRAM3_PAGE1_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM3_PAGE2_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM3_PAGE3_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM3_PAGE4_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM3_PAGE5_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM3_FULL_STOP_RETENTION)  ||\
                                                  ((__RAM__) == PWR_SRAM4_FULL_STOP_RETENTION)  ||\
                                                  ((__RAM__) == PWR_ICACHE_STOP_RETENTION)      ||\
                                                  ((__RAM__) == PWR_FDCAN_USB_STOP_RETENTION)   ||\
                                                  ((__RAM__) == PWR_PKA_STOP_RETENTION))
#elif defined(PWR_SRAM1_PAGE6_STOP_RETENTION)
#define IS_PWR_RAM_STOP_RETENTION(__RAM__)       (((__RAM__) == PWR_SRAM1_PAGE1_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE2_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE3_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE4_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE5_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE6_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE7_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_FULL_STOP_RETENTION)  ||\
                                                  ((__RAM__) == PWR_SRAM2_PAGE1_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM2_PAGE2_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM2_PAGE3_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM2_FULL_STOP_RETENTION)  ||\
                                                  ((__RAM__) == PWR_ICACHE_STOP_RETENTION)      ||\
                                                  ((__RAM__) == PWR_FDCAN_USB_STOP_RETENTION)   ||\
                                                  ((__RAM__) == PWR_PKA_STOP_RETENTION))
#else
#define IS_PWR_RAM_STOP_RETENTION(__RAM__)       (((__RAM__) == PWR_SRAM1_PAGE1_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE2_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE3_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE4_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_PAGE5_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM1_FULL_STOP_RETENTION)  ||\
                                                  ((__RAM__) == PWR_SRAM2_PAGE1_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM2_PAGE2_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM2_PAGE3_STOP_RETENTION) ||\
                                                  ((__RAM__) == PWR_SRAM2_FULL_STOP_RETENTION)  ||\
                                                  ((__RAM__) == PWR_ICACHE_STOP_RETENTION)      ||\
                                                  ((__RAM__) == PWR_FDCAN_USB_STOP_RETENTION)   ||\
                                                  ((__RAM__) == PWR_PKA_STOP_RETENTION))
#endif /* RAMCFG_SRAM3 */

