stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_pwr_ex.h
/* SRAM2 retention in Standby mode check macro */
#define IS_PWR_SRAM2_STANDBY_RETENTION(__PAGE__) (((__PAGE__) == PWR_SRAM2_PAGE1_STANDBY_RETENTION) ||\
                                                  ((__PAGE__) == PWR_SRAM2_PAGE2_STANDBY_RETENTION) ||\
                                                  ((__PAGE__) == PWR_SRAM2_PAGE3_STANDBY_RETENTION) ||\
                                                  ((__PAGE__) == PWR_SRAM2_FULL_STANDBY_RETENTION))

/* I3C Pull-up configuration check macro */
#if defined(PWR_I3CPU_PB7)
#define  IS_PWR_I3C_PULLUP_GPIO(__GPIO__)        (((__GPIO__) == PWR_I3CPU_PA1)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PA6)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PA7)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB2)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB6)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB7)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB8)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB9)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB10) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB12) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB13) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB14) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PC0)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PC1)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PD12) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PD13) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PG7)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PG8)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PG13) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PG14) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PH3)  ||\
                                                  ((__GPIO__) == PWR_I3CPUCR_ALL))
#elif defined(PWR_I3CPU_PB8)
#define  IS_PWR_I3C_PULLUP_GPIO(__GPIO__)        (((__GPIO__) == PWR_I3CPU_PA1)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PA6)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PA7)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB2)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB6)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB8)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB9)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB10) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB12) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB13) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB14) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PC0)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PC1)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PD12) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PD13) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PG7)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PG8)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PG13) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PG14) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PH3)  ||\
                                                  ((__GPIO__) == PWR_I3CPUCR_ALL))
#else
#define  IS_PWR_I3C_PULLUP_GPIO(__GPIO__)        (((__GPIO__) == PWR_I3CPU_PA1)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PA6)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PA7)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB2)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB6)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB10) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB12) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PB13) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PC1)  ||\
                                                  ((__GPIO__) == PWR_I3CPU_PD12) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PD13) ||\
                                                  ((__GPIO__) == PWR_I3CPU_PH3)  ||\
                                                  ((__GPIO__) == PWR_I3CPUCR_ALL))
#endif  /* defined(PWR_I3CPU_PB7) */
/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions PWR Extended Exported Functions
  * @{
  */

/** @addtogroup PWREx_Exported_Functions_Group1 Power Supply Control Functions
  * @{
  */
HAL_StatusTypeDef HAL_PWREx_ControlVoltageScaling(uint32_t VoltageScaling);
uint32_t          HAL_PWREx_GetVoltageRange(void);

void              HAL_PWREx_EnableVddUSB(void);
void              HAL_PWREx_DisableVddUSB(void);
#if defined(PWR_SVMCR_IO2SV)
void              HAL_PWREx_EnableVddIO2(void);
void              HAL_PWREx_DisableVddIO2(void);
#endif /* PWR_SVMCR_IO2SV */
void              HAL_PWREx_EnableVddA(void);
void              HAL_PWREx_DisableVddA(void);

HAL_StatusTypeDef HAL_PWREx_EnableEpodBooster(void);
HAL_StatusTypeDef HAL_PWREx_DisableEpodBooster(void);

HAL_StatusTypeDef HAL_PWREx_ConfigSupply(uint32_t SupplySource);
uint32_t          HAL_PWREx_GetSupplyConfig(void);
void              HAL_PWREx_EnableFastSoftStart(void);
void              HAL_PWREx_DisableFastSoftStart(void);
void              HAL_PWREx_EnableBatteryCharging(uint32_t ResistorValue);
void              HAL_PWREx_DisableBatteryCharging(void);
/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions_Group2 Low Power Control Functions
  * @{
  */
void HAL_PWREx_EnterSHUTDOWNMode(void);
void HAL_PWREx_EnableUltraLowPowerMode(void);
void HAL_PWREx_DisableUltraLowPowerMode(void);
/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions_Group3 Memories Retention Functions
  * @{
  */
void              HAL_PWREx_EnableRAMsPowerDown(uint32_t RAMSelection);
void              HAL_PWREx_DisableRAMsPowerDown(uint32_t RAMSelection);
void              HAL_PWREx_EnableRAMsContentStopRetention(uint32_t RAMSelection);
void              HAL_PWREx_DisableRAMsContentStopRetention(uint32_t RAMSelection);
void              HAL_PWREx_EnableSRAM2ContentStandbyRetention(uint32_t SRAM2Pages);
void              HAL_PWREx_DisableSRAM2ContentStandbyRetention(uint32_t SRAM2Pages);
void              HAL_PWREx_EnableFlashFastWakeUp(void);
void              HAL_PWREx_DisableFlashFastWakeUp(void);
void              HAL_PWREx_EnableSRAMFastWakeUp(void);
void              HAL_PWREx_DisableSRAMFastWakeUp(void);

/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions_Group4 I/O Pull-Up Pull-Down Configuration Functions
  * @{
  */
void              HAL_PWREx_EnablePullUpPullDownConfig(void);
void              HAL_PWREx_DisablePullUpPullDownConfig(void);
HAL_StatusTypeDef HAL_PWREx_EnableGPIOPullUp(uint32_t GPIO_Port, uint32_t GPIO_Pin);
HAL_StatusTypeDef HAL_PWREx_DisableGPIOPullUp(uint32_t GPIO_Port, uint32_t GPIO_Pin);
HAL_StatusTypeDef HAL_PWREx_EnableGPIOPullDown(uint32_t GPIO_Port, uint32_t GPIO_Pin);
HAL_StatusTypeDef HAL_PWREx_DisableGPIOPullDown(uint32_t GPIO_Port, uint32_t GPIO_Pin);
/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions_Group5 I3C Pull-Up Configuration Functions
  * @{
  */
HAL_StatusTypeDef HAL_PWREx_EnableI3CPullUp(uint32_t Gpio);
HAL_StatusTypeDef HAL_PWREx_DisableI3CPullUp(uint32_t Gpio);
/**
  * @}
  */

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32U3xx_HAL_PWR_EX_H */
